Use mermaid notation
